import pyperclip
from license_maker import data_dict
from datetime import datetime


letter = f"""{data_dict['user']}, добрый день!

Благодарю Вас за интерес проявленный к ExcelComber.
Файл лицензии во вложении.
Пробный период до {data_dict['trial_finish'][:10]}г.\n\n
Если ExcelComber не подходит для задач, которые Вы собирались с его помощью решить, напишите мне -
я обязательно предложу решение, которое подойдёт именно в Вашем случае.\n\n
Если Вы захотите использовать ExcelComber по истечении пробного периода, свяжитесь со мной ещё раз и я вышлю Вам постоянную лицензию.
За неё я попрошу с Вас вознаграждение, размер которого оставлю на Ваше усмотрение, если Вы частное лицо.
Если Вы представляете организацию, размер вознаграждения определим в ходе обсуждения.\n\n
Вопросы по работе программы можете задавать через электронную почту team@excelcomber.ru\n\n
Буду рад узнать Ваше мнение о ExcelComber - пишите!\n\n\n
С уважением,
разработчик ExcelComber
Цветков Дмитрий
"""
pyperclip.copy(letter)
print(letter)